# -*- coding: utf-8 -*-

print('python3 运算符')
print('''
    算术运算符
    比较（关系）运算符
    赋值运算符
    逻辑运算符
    位运算符
    成员运算符
    身份运算符
    运算符优先级
    ''')

print('---------------------------------------------------------------------------------')

print('算术运算符')
print('''
    + 加
    - 减
    * 剩
    / 除
    % 取模
    **	幂 - 返回x的y次幂
    // 取整除
''')

a = 21
b = 10
c = 0

c = a + b
print("1 - c 的值为：", c)

c = a - b
print("2 - c 的值为：", c)

c = a * b
print("3 - c 的值为：", c)

c = a / b
print("4 - c 的值为：", c)

c = a % b
print("5 - c 的值为：", c)

# 修改变量 a 、b 、c
a = 2
b = 3
c = a ** b
print("6 - c 的值为：", c)

a = 10
b = 5
c = a // b
print("7 - c 的值为：", c)
print('---------------------------------------------------------------------------------')

print('Python比较运算符')
print('''
     == 等于
     != 不等于
     >
     < 
     >= 
     <= 
''')
print('---------------------------------------------------------------------------------')

print('Python赋值运算符')
print('''
    = 简单赋值
    += 加赋值
    -= 减赋值
    *= 乘赋值
    /= 除赋值
    %= 取模赋值
    **= 幂 赋值
    //= 取整除赋值
''')
print('---------------------------------------------------------------------------------')

print('Python位运算符')
print('''
    &
    |
    ^
    ~
    <<
    >>
    ''')
print('---------------------------------------------------------------------------------')

print('Python逻辑运算符')
print('''
    and 与 or 或 not 非
    ''')
a = 10
b = 20

if (a and b):
    print("1 - 变量 a 和 b 都为 true")
else:
    print("1 - 变量 a 和 b 有一个不为 true")

if (a or b):
    print("2 - 变量 a 和 b 都为 true，或其中一个变量为 true")
else:
    print("2 - 变量 a 和 b 都不为 true")

# 修改变量 a 的值
a = 0
if (a and b):
    print("3 - 变量 a 和 b 都为 true")
else:
    print("3 - 变量 a 和 b 有一个不为 true")

if (a or b):
    print("4 - 变量 a 和 b 都为 true，或其中一个变量为 true")
else:
    print("4 - 变量 a 和 b 都不为 true")

if not (a and b):
    print("5 - 变量 a 和 b 都为 false，或其中一个变量为 false")
else:
    print("5 - 变量 a 和 b 都为 true")

print('---------------------------------------------------------------------------------')

print('Python成员运算符')
print('''
    in not in 
    ''')
print('---------------------------------------------------------------------------------')

print('Python身份运算符')
print('''
    is is not 
    ''')
print('---------------------------------------------------------------------------------')


print('Python字符串格式化')
print ("我叫 %s 今年 %d 岁!" % ('小明', 10))

